[{
    "id":"001",
    "title":"Field Operation and survey application",
    "date":"2022-01-10",
"description":"Developed a field survey collection system for a U.S. territory, enabling seamless volunteer onboarding, group assignment, and guided data collection. The platform integrates census block maps to help volunteers accurately navigate and capture area-specific survey information. It streamlines coordination, improves data accuracy, and supports efficient large-scale field operations.",
    "project_link":null,
    "read_more_link":null
},
{
    "id":"002",
    "title":"Multi Vendor Food Delivery Application",
    "date":"2021-05-10",
    "description":"App lets users explore multiple restaurants, place orders, and get food delivered by an auto-assigned delivery partner. Each restaurant manages its own menu and orders independently. Built using React Native, it runs smoothly on both iOS and Android, offering real-time tracking, secure payments, and notifications",
    "project_link":null,
    "read_more_link":null
},
{
    "id":"003",
    "title":"Content Recommender System",
    "date":"2020-05-10",
    "description":"Collaborative filtering and psychographic models to understand customer similarities. By calculating Euclidean distance between user preference points, it identifies closely related customers and suggests products they are likely to buy. This personalized approach increases engagement, improves user satisfaction, and ultimately boosts sales for the business",
    "project_link":null,
    "read_more_link":null
},{
    "id":"004",
    "title":"API Documention as a Code",
    "date":"2025-10-01",
    "description":"API documentation generated directly from code provides clearly abstracted methods for HTTP and system APIs. This is usefull machine-readable API docs also support code-generation LLMs and Language Server Protocol integrations, allowing them to produce accurate suggestions, and improving the overall developer experience",
     "project_link":null,
    "read_more_link":null    
}
]